### Задание 1

In [9]:
import pandas as pd

In [10]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']})

In [11]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]})

### Задание 2

In [15]:
authors_price = pd.merge(authors, books, on='author_id', how = 'inner')

In [16]:
authors_price.drop("author_id", axis=1, inplace=True)

In [17]:
authors_price

  author_name            book_title  price
0    Тургенев           Отцы и дети    450
1    Тургенев                 Рудин    300
2    Тургенев     Дворянское гнездо    350
3       Чехов      Толстый и тонкий    500
4       Чехов       Дама с собачкой    450
5  Островский                 Гроза    370
6  Островский  Таланты и поклонники    290

### 3 задание

In [24]:
authors_price_top = authors_price.sort_values(by='price').tail()

In [26]:
authors_price_top

  author_name         book_title  price
2    Тургенев  Дворянское гнездо    350
5  Островский              Гроза    370
0    Тургенев        Отцы и дети    450
4       Чехов    Дама с собачкой    450
3       Чехов   Толстый и тонкий    500

### 4 задание

In [27]:
group_author = authors_price.groupby("author_name")

In [30]:
group_author.agg({"price": "max"})

             price
author_name
Островский     370
Тургенев       450
Чехов          500

In [31]:
group_author.agg({"price": "min"})

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [33]:
group_author.agg({"price": "mean"})

                  price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [38]:
pd.concat([group_author.agg({"price": "max"}), group_author.agg({"price": "min"}),group_author.agg({"price": "mean"})], axis=1, ignore_index=True)

               0    1           2
author_name
Островский   370  290  330.000000
Тургенев     450  300  366.666667
Чехов        500  450  475.000000